Revit 2024 API
ParameterTypeId.ViewGraphSunPath Property
 "Sun Path"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId ViewGraphSunPath { get; }
Visual Basic
Public Shared ReadOnly Property ViewGraphSunPath As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ ViewGraphSunPath {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace